# vi: syntax=ruby

brew 'ansible'
brew 'bash'
brew 'curl'
brew 'fzf'
brew 'git'
brew 'gnupg'
brew 'golangci-lint'
brew 'htop'
brew 'jq'
brew 'make'
brew 'neovim'
brew 'pidof'
brew 'pwgen'
brew 'restic'
brew 'ripgrep'
brew 'shellcheck'
brew 'shfmt'
brew 'stow'
brew 'tmux'
brew 'tree'
brew 'watch'
brew 'wget'
brew 'zsh'
brew 'zsh-completions'

# gnutils
brew 'coreutils'
brew 'diffutils'
brew 'findutils'
brew 'gawk'
brew 'gnu-sed'
brew 'gnu-tar'
brew 'grep'

# tap 'universal-ctags/universal-ctags'
# brew 'universal-ctags', args: ['HEAD']

# casks
# cask 'brave-browser' # Installed manually, uncomment if reinstalling
cask 'authy'
cask 'discord'
cask 'docker'
cask 'flycut'
cask 'google-chrome'
cask 'google-cloud-sdk'
cask 'istat-menus'
cask 'keybase'
cask 'kitty'
cask 'lastpass'
cask 'obsidian'
cask 'shiftit'
cask 'signal'
cask 'slack'
cask 'whatsapp'

tap 'homebrew/cask-fonts'
cask 'font-inconsolata'
cask 'font-inconsolata-nerd-font'

# mac app store
# Be focused
