tap 'caskroom/versions'
tap 'caskroom/fonts'
tap 'universal-ctags/universal-ctags'
tap 'gocardless/homebrew-taps'

cask 'aws-vault'
cask 'dropbox'
cask 'flycut'
cask 'font-inconsolata'
cask 'google-cloud-sdk'
cask 'iterm2-nightly'
cask 'keybase'
cask 'minikube'
cask 'shiftit'
cask 'slack'
cask 'vagrant'
cask 'virtualbox'

# TODO reenable with --HEAD
# brew 'universal-ctags'

brew 'ack'
brew 'ansible'
brew 'bash'
brew 'bash-completion2'
brew 'chruby'
brew 'coreutils'
brew 'curl'
brew 'direnv'
brew 'docker'
brew 'docker-machine'
brew 'git'
brew 'go'
brew 'gpg'
brew 'htop'
brew 'ipcalc'
brew 'jq'
brew 'kubernetes-cli'
brew 'mas'
brew 'neovim'
brew 'pinentry-mac' # for gpg-agent
brew 'pv'
brew 'ripgrep'
brew 'ruby-install'
brew 'rustup'
brew 'shellcheck'
brew 'smartmontools'
brew 'stow'
brew 'terraform'
brew 'the_silver_searcher'
brew 'tmux'
brew 'tree'
brew 'vim'
brew 'watch'
brew 'wget'
brew 'zsh'

# GC
brew 'anu'
