# vi: syntax=ruby

brew 'ansible'
brew 'awscli'
brew 'azure-cli'
brew 'bash'
brew 'cmake' # GDK
brew 'curl'
brew 'dep'
brew 'direnv'
brew 'docker'
brew 'fzf'
brew 'git'
brew 'git-trim'
brew 'gpg'
brew 'gpgme' # GDK
brew 'graphicsmagick' # GDK
brew 'htop'
brew 'jq'
brew 'k3d'
brew 'kube-ps1'
brew 'kubectx'
brew 'lastpass-cli'
brew 'libiconv' # GDK
brew 'make'
brew 'mdcat'
brew 'neovim'
brew 'openssl' # GDK
brew 'pidof'
brew 'pinentry-mac'
brew 'pkg-config' # GDK
brew 'postgresql@9.6' # GDK # TODO: Manual: `brew pin postgresql@9.6`
brew 'pwgen'
brew 'python'
brew 're2' # GDK
brew 'redis' # GDK
brew 'restic'
brew 'ripgrep'
brew 'runit' # GDK
brew 'shellcheck'
brew 'shfmt'
brew 'stow'
brew 'tfenv'
brew 'tmux'
brew 'tree'
brew 'vim'
brew 'watch'
brew 'wget'
brew 'yamllint'
brew 'yarn', args: ['ignore-dependencies'] # GDK. ignore-dependencies is ignored on `brew upgrade`.
brew 'ykman'
brew 'zsh'
brew 'zsh-completions'  # TODO used?

tap 'universal-ctags/universal-ctags'
brew 'universal-ctags', args: ['HEAD']

tap 'jeantil/autokbisw'
brew 'autokbisw', restart_service: :changed

tap 'golangci/tap'
brew 'golangci-lint'

# gnutils
brew 'coreutils'
brew 'diffutils'
brew 'findutils'
brew 'gawk'
brew 'gnu-sed'
brew 'gnu-tar'
brew 'grep'

# casks
cask '1password'
cask '1password-cli'
cask 'chromedriver' # GDK
cask 'docker'
cask 'firefox'
cask 'flycut'
cask 'font-source-code-pro'
cask 'google-chrome'
cask 'google-cloud-sdk'
cask 'graphiql'
cask 'keybase'
cask 'minikube'
cask 'ngrok'
cask 'postman'
cask 'sensiblesidebuttons'
cask 'shiftit'
cask 'signal'
cask 'slack'
cask 'vagrant'
cask 'virtualbox'
cask 'whatsapp'
cask 'zoomus'

# cask 'gswitch'  # TODO doesn't behave properly on wake. Apparently unsafe mode fixes

tap 'homebrew/cask-fonts'
cask 'font-inconsolata'

# TODO device not recognised
# tap 'homebrew/cask-drivers'
# cask 'logitech-control-center'
# cask 'logitech-options'

# App store - TODO automate with mas when that works
# Todoist
# Status Clock
# Be Focussed
# # NordVPN
